app/views/notes/index.html.erb

<% if @pagy.page > 1 %>
  <%= link_to "Previous", user_notes_path(Current.user) + "?page=" + (@pagy.page - 1).to_s, role: "button", class: "hotwire-native-hidden"  %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

<% else %>
  <%= link_to "Next", user_notes_path(Current.user) + "?page=" + (@pagy.page.next).to_s, role: "button", class: "hotwire-native-hidden" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1