app/views/status/status.html.erb

<p>
  Signed in: <%= Current.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1