app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def authenticate
    token = Rails.env.test? ? cookies[:session_token] : cookies.signed[:session_token]

    if token.present? && (session_record = Session.find_by_id(token))
      begin
        if session_record.user_id && (user = User.find_by(id: session_record.user_id))

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def set_current_request_details
    token = Rails.env.test? ? cookies[:session_token] : cookies.signed[:session_token]

    return unless token.present?

    session_record = Session.find_by_id(token)

    if session_record&.user_id
      user = User.find_by(id: session_record.user_id)