app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)

    ImageToFileJob.perform_later(Current.user.id, @note.id, @note.img) # if @note.persisted?

    if @note.save
---
INSERT INTO "notes" ("id", "title", "content", "created_at", "updated_at") VALUES ('a515c554-8618-419b-9c32-b01088176fc7', NULL, 'dddd', '2025-03-25 16:03:12.005629', '2025-03-25 16:03:12.005629') RETURNING "id"