app/controllers/notes_controller.rb

INSERT INTO "notes" ("id", "title", "content", "created_at", "updated_at") VALUES ('c688d533-b702-4a28-aaa8-d67664c4cb6e', NULL, NULL, '2025-04-11 17:43:11.706339', '2025-04-11 17:43:11.706339') RETURNING "id"
---
  def create
    @note = Note.new(note_params)

    ImageToFileJob.perform_later(Current.user.id, @note.id, @note.img) # if @note.persisted?

    if @note.save

UPDATE "notes" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "Updated Title"], ["content", "Updated content"], ["updated_at", "2025-02-24 15:04:14.994150"], ["id", 86]]
---
  def update
    if @note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = 'c0da86ef-a347-42e9-ae83-846148c3c8aa'
---
  def destroy
    @note.destroy

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 'c529926d-31a5-4044-ac97-f1dea9783b49' LIMIT 1
---
  def set_note
    @note = Note.find(params[:id])