app/controllers/registrations_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = 'fubar@example.com' LIMIT 1
---
  def send_code
    email = params[:email]

    if User.exists?(email: email)