app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "verified", "created_at", "updated_at", "notification_time") VALUES ('fubar@example.com', '$2a$12$y/DD/TFoN68InnCZnceOGeYe6FYRgJw5uoE4DoVEQosGKCc52/v76', 0, '2025-06-13 17:12:41.762074', '2025-06-13 17:12:41.762074', '2000-01-01 07:00:00') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save