app/controllers/sessions_controller.rb

  def validate_otp
    email = params[:email]
    user = User.find_by(email: email)

    if user.blank?
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'foo@example.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'fubar@example.com' LIMIT 1