app/controllers/status_controller.rb

  def signed_in
    render json: { signed_in: Current.user.present? }
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1