app/jobs/image_to_text_job.rb

  def perform(user_id, note_id)

    # file_path = Rails.root.join('public', 'uploads', "user_#{user_id}", "#{note_id}.png")
    file_path = Rails.root.join('uploads', "user_#{user_id}", "#{note_id}.png")

    response = ImageToTextConverter.convert(file_path)

    user = User.find_by(id: user_id)

    Note.set_database_connection(user)

    note = Note.find_by(id: note_id)
    note.content = response
    note.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 'c688d533-b702-4a28-aaa8-d67664c4cb6e' LIMIT 1
UPDATE "notes" SET "content" = 'hello', "updated_at" = '2025-04-11 17:43:11.776206' WHERE "notes"."id" = 'c688d533-b702-4a28-aaa8-d67664c4cb6e'