app/jobs/image_to_file_job.rb

  def perform(user_id, note_id, image_data)
    file_path = Rails.root.join('uploads', "#{user_id}", "#{note_id}.png")

    image_data = image_data.sub('data:image/png;base64,', '')

    file = File.open(file_path, 'wb')
    file.write(Base64.decode64(image_data))
    file.close

    user = User.find(user_id)

    Note.set_database_connection(user)

    note = Note.find(note_id)
    note.image_saved = true
    note.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "notes".* FROM "notes" WHERE "notes"."id" = '80d14be9-79b1-4af3-a36f-259b633a2a39' LIMIT 1
UPDATE "notes" SET "content" = 'foo', "updated_at" = '2025-03-25 21:31:43.541983' WHERE "notes"."id" = '16b57bf0-d76a-4ccd-9628-08038c39e72e'